Revit 2027 API
ParameterTypeId.AnalyticalSurface Property
 "Analytical Surface"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalSurface { get; }
Public Shared ReadOnly Property AnalyticalSurface As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalSurface {
	ForgeTypeId^ get ();
}
static member AnalyticalSurface : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace